results/factorial-final/security-overhead-final-plaintext-broker3/security-overhead-final-factorial-plaintext-b3-rf3-isr3-msg1024-tps10000-batch16384-acksall-prod12-compnone-trial3/producer-perf-4.log
producer_index=4
producer_count=12
producer_records=8334
producer_throughput=834
1 records sent, 0.1 records/sec (0.00 MB/sec), 1023.0 ms avg latency, 1023.0 ms max latency.
4500 records sent, 890.4 records/sec (0.87 MB/sec), 1803.0 ms avg latency, 10078.0 ms max latency.
8334 records sent, 491.044073 records/sec (0.48 MB/sec), 2243.44 ms avg latency, 10078.00 ms max latency, 2415 ms 50th, 2885 ms 95th, 2963 ms 99th, 2989 ms 99.9th.